app/controllers/users_controller.rb

  def index
    gon.users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "nic_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "peter parcker"], ["nic_name", "spider man"], ["created_at", "2015-07-29 15:10:50.546406"], ["updated_at", "2015-07-29 15:10:50.546406"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "nic_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nic_name", ""], ["updated_at", "2015-07-29 15:19:32.152795"], ["id", 2]]